Tekla.Structures.ModelInternal.ICDelegate.ExportGetAttributeFiles(Tekla.Structures.ModelInternal.dotGetAttributeFiles_t@)
DO NOT USE! For internal usage only!
data:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetAttributeFilesWithPrefix(Tekla.Structures.ModelInternal.dotGetAttributeFiles_t@)
DO NOT USE! For internal usage only!
data:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportTryGetSubdirectoryFromFileName(Tekla.Structures.ModelInternal.dotTryGetSubdirectoryFromFileName_t@)
DO NOT USE! For internal usage only!
data:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.